documents/SharePoint/SPDevelopWithVS/C11.org
#+title:打包和部署

* 基础和超越
  在本书中，你已经看了很多例子，创建不同类型的SharePoint部件并将他们部
  署到SharePoint中。在大部分情况下，我们可以在项目中添加部件（列表，网
  络部件，事件接收器等）然后按 F5 进行打包，并部署到SharePoint中。

  在本章，我们要讨论的是：在按F5键后，打包和部署SharePoint部件这些操作
  背后到底发生了什么。此外，还会讨论什么时候，怎么样以及为什么修改默认
  的打包和部署设置。还会展示如何使用Visual Studio来创建自定义的部署步
  骤和部署配置。
