documents/SharePoint/SPDevelopWithVS/C11.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>打包和部署</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-25 14:39:39 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">打包和部署</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 基础和超越 </a></li>
<li><a href="#sec-2">2 SharePoint的特性（Features） </a></li>
<li><a href="#sec-3">3 SharePoint元素 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基础和超越 </h2>
<div class="outline-text-2" id="text-1">

<p>  在本书中，你已经看了很多例子，创建不同类型的SharePoint部件并将他们部
  署到SharePoint中。在大部分情况下，我们可以在项目中添加部件（列表，网
  络部件，事件接收器等）然后按 F5 进行打包，并部署到SharePoint中。
</p>
<p>
  在本章，我们要讨论的是：在按F5键后，打包和部署SharePoint部件这些操作
  背后到底发生了什么。此外，还会讨论什么时候，怎么样以及为什么修改默认
  的打包和部署设置。还会展示如何使用Visual Studio来创建自定义的部署步
  骤和部署配置。
</p></div>

</div>
