documents/SharePoint/SPDevelopWithVS/C11.org
* SharePoint元素
  目前为止，在本章中很多次提到了“元素”这个词。不幸的是，我们还会更多
  提到这个词。在本章中有时提到元素，指的是XML元素，如Feature.xml中的
  <Feature> XML元素。还讨论了XML元素ElementManifests和ElementManifest，
  他们在Feature.xml文件中用来将SharePoint项目项的Element.xml和特性关联
  起来。Elements.xml文件是另一个经常提到的“元素” -- Element.xml文件
  与SharePoint项目项相关联，它还包含SharePoint部署SharePoint项目项中的
  功能时需要的信息。

  还有一个必须介绍的“元素”就是SharePoint“元素”。本书中的大部分章节
  都是将重点放在一个或多个SharePoint元素，如内容类型，工作流，列表定义
  和列表实例。大部分情况下，Visual Studio提供为这些SharePoint元素提供
  一个项目项，因此，目前为止可以侥幸不用称呼“SharePoint元素”，而是用
  “SharePoint项目项”来代替。不过，还有更多SharePoint元素可以被创建和
  部署，而他们没有对应的SharePoint项目项。表11-4列出了SharePoint元素及
  他们的描述。

#+CAPTION: 表11-4:SharePoint元素的描述及他们对应的SharePoint项目项

| / | <>                | <>                     | <>                                                                                                   |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 元素              | 对应的SharePoint项目项 | 描述                                                                                                 |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 内容类型          | ContentType            | 见第7章描述的内容类型，“SharePoint内容类型”                                                        |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 内容类型绑定      | N/A                    | 用来定义为list定义内容类型，其中list是那种不可以直接被修改（list按照onet.xml结构定义）               |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 自定义操作        | N/A                    | 允许自定义操作到链接或工具栏项上                                                                     |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 自定义操作组      | N/A                    | 用来分组自定义操作                                                                                   |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 委托控件          | N/A                    | 用来为某一功能指定控件，并为这些控件选择功能提供器。例如，可以指定一个控件，然后向该控件添加提示信息 |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 文档转换器        | N/A                    | 用来定义文档转换器                                                                                   |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 事件接收器        | Event Receiver         | 见第5章，“SharePoint事件接收器”                                                                    |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 特性/网站模板关联 | N/A                    | 包含指定特性，使其作为网站定义配置的一部分                                                           |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 字段元素          | N/A                    | 用来创建网站列                                                                                       |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 隐藏自定义行为    | N/A                    | 允许隐藏自定义行为                                                                                   |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 列表实例          | List Instance          | 用来定义列表实例                                                                                     |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 模块              | Module                 | 模块用来部署那些支持特性的文件                                                                       |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|
| # | 工作流            | Workflow               | SharePoint工作流在第八章介绍，“SharePoint工作流”                                                   |
|---+-------------------+------------------------+------------------------------------------------------------------------------------------------------|

#+BEGIN_SRC html
   这些元素在Visual Studio 2010中的什么地方
   已经注意到，上表中一些元素没有对应的Visual Studio 2010的项目项。虽然
   所有的元素可以添加到Visual Studio发布的特性中，然而不是所有的元素都
   有对应的项目项。不过，这不意味着SharePoint元素没有对应的项目项，就不
   能在Visual Studio 2010中创建和部署这些SharePoint元素。例如，需要部署
   一个自定义行为，可以使用空元素项目项模板。这就是空元素项目项存在的原
   因，他弥补了Visual Studio项目项没有对应的SharePoint元素的缺陷。空元
   素项目项是一个空项目，其中包含一个Element.xml文件，可以将想添加到项
   目中的SharePoint元素的XML描述符添加到Element.xml中。
#+END_SRC

#+BEGIN_SRC html
   表11-4中好像少了点什么--例如，Web部件和应用页在哪儿
   Web部件，可视Web部件和应用页没有出现在表11-4中，因为他们没有对应的
   SharePoint元素。如果打开Web部件项目的Elements.xml，会发现它是以模块
   方式部署的。web部件的定义保存在.webpar文件中，这个文件是通过模块元
   素部署到SharePoint中的。因为应用页就是一个.aspx文件，所以不需要对应
   的SharePoint元素来部署它--应用页作为SharePoint包中的模板文件被部署
   到SharePoint中。
#+END_SRC

   每个在表11-4中描述的元素可以部署的范围是不同的。表11-5给出了各个元
   素可以部署和激活的范围。

#+CAPTION：元素和支持的范围


| /                 | <>   | <>              | <>   | <>  |
|-------------------+------+-----------------+------+-----|
| 元素              | Farm | Web Application | Site | Web |
|-------------------+------+-----------------+------+-----|
| 内容类型          |      |                 | Y    |     |
|-------------------+------+-----------------+------+-----|
| 内容类型绑定      |      |                 | y    |     |
|-------------------+------+-----------------+------+-----|
| 自定义行为        | y    | y               | y    | y   |
|-------------------+------+-----------------+------+-----|
| 自定义行为分组    | y    | y               | y    | y   |
|-------------------+------+-----------------+------+-----|
| 委托控件          | y    | y               | y    | y   |
|-------------------+------+-----------------+------+-----|
| 文档转换器        |      |                 |      | y   |
|-------------------+------+-----------------+------+-----|
| 事件接收器        |      |                 | y    | y   |
|-------------------+------+-----------------+------+-----|
| 特性/网站模板关联 | y    | y               | y    |     |
|-------------------+------+-----------------+------+-----|
| 字段元素          |      |                 | y    |     |
|-------------------+------+-----------------+------+-----|
| 隐藏自定义行为    | y    | y               | y    | y   |
|-------------------+------+-----------------+------+-----|
| 列表实例          |      |                 | y    | y   |
|-------------------+------+-----------------+------+-----|
| 列表模板          |      |                 | y    | y   |
|-------------------+------+-----------------+------+-----|
| 模块              |      |                 | y    | y   |
|-------------------+------+-----------------+------+-----|
| 工作流            |      |                 | y    |     | 
  

* 部署SharePoint特性
  已经介绍了什么是SharePoint元素，以及如何限定范围，现在介绍如何部署
  SharePoint特性到服务器。
  当部署特性时，会将Feature.xml文件和Elements.xml文件拷贝到服务器文件
  系统中。
